Tekla Open API Reference for Tekla Structures 2025
UnknownLoftedPlateErrorException Class
 This class represent an exception thrown when an operation on a lofted plate caused an error of unknown origin
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.LoftedPlateOperationException
 Tekla.Structures.Model.UnknownLoftedPlateErrorException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class UnknownLoftedPlateErrorException : LoftedPlateOperationException
Public Class UnknownLoftedPlateErrorException
	Inherits LoftedPlateOperationException
The UnknownLoftedPlateErrorException type exposes the following members.
Constructors
Name | Description
UnknownLoftedPlateErrorException
 Constructs an instance of the class
Top
See Also
Reference
Tekla.Structures.Model Namespace